MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS708/mcu.h
extern volatile SPI3IMSKHBITS SPI3IMSKHbits __attribute__((__sfr__));

#define SPI3URDTL SPI3URDTL
extern volatile uint16_t SPI3URDTL __attribute__((__sfr__));
__extension__ typedef struct tagSPI3URDTLBITS {
  union {
    struct {
      uint16_t SPI3URDTL:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI3URDTLBITS;
extern volatile SPI3URDTLBITS SPI3URDTLbits __attribute__((__sfr__));

#define SPI3URDTH SPI3URDTH
extern volatile uint16_t SPI3URDTH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3URDTHBITS {
  union {
    struct {
      uint16_t SPI3URDTH:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI3URDTHBITS;
extern volatile SPI3URDTHBITS SPI3URDTHbits __attribute__((__sfr__));

#define RPOR0 RPOR0
extern volatile uint16_t RPOR0 __attribute__((__sfr__));
typedef struct tagRPOR0BITS {
  uint16_t RP16R:7;
  uint16_t :1;
  uint16_t RP17R:7;
} RPOR0BITS;
extern volatile RPOR0BITS RPOR0bits __attribute__((__sfr__));

#define RPOR1 RPOR1
extern volatile uint16_t RPOR1 __attribute__((__sfr__));
typedef struct tagRPOR1BITS {
  uint16_t RP18R:7;
  uint16_t :1;
  uint16_t RP19R:7;
} RPOR1BITS;
extern volatile RPOR1BITS RPOR1bits __attribute__((__sfr__));

#define RPOR2 RPOR2
extern volatile uint16_t RPOR2 __attribute__((__sfr__));
typedef struct tagRPOR2BITS {
  uint16_t RP20R:7;
  uint16_t :1;
  uint16_t RP32R:7;
} RPOR2BITS;
extern volatile RPOR2BITS RPOR2bits __attribute__((__sfr__));

#define RPOR3 RPOR3
extern volatile uint16_t RPOR3 __attribute__((__sfr__));
typedef struct tagRPOR3BITS {
  uint16_t RP33R:7;
  uint16_t :1;
  uint16_t RP34R:7;
} RPOR3BITS;
extern volatile RPOR3BITS RPOR3bits __attribute__((__sfr__));

#define RPOR4 RPOR4
extern volatile uint16_t RPOR4 __attribute__((__sfr__));
typedef struct tagRPOR4BITS {
  uint16_t RP35R:7;
  uint16_t :1;
  uint16_t RP36R:7;
} RPOR4BITS;
extern volatile RPOR4BITS RPOR4bits __attribute__((__sfr__));

#define RPOR5 RPOR5
extern volatile uint16_t RPOR5 __attribute__((__sfr__));
typedef struct tagRPOR5BITS {
  uint16_t RP37R:7;
  uint16_t :1;
  uint16_t RP38R:7;
} RPOR5BITS;
extern volatile RPOR5BITS RPOR5bits __attribute__((__sfr__));

#define RPOR6 RPOR6
extern volatile uint16_t RPOR6 __attribute__((__sfr__));
typedef struct tagRPOR6BITS {
  uint16_t RP39R:7;
  uint16_t :1;
  uint16_t RP40R:7;
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t RPOR7 __attribute__((__sfr__));
typedef struct tagRPOR7BITS {
  uint16_t RP41R:7;
  uint16_t :1;
  uint16_t RP43R:7;
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t RPOR8 __attribute__((__sfr__));
typedef struct tagRPOR8BITS {
  uint16_t RP44R:7;
  uint16_t :1;
  uint16_t RP45R:7;
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

#define RPOR9 RPOR9
extern volatile uint16_t RPOR9 __attribute__((__sfr__));
typedef struct tagRPOR9BITS {
  uint16_t RP46R:7;
  uint16_t :1;
  uint16_t RP47R:7;
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

#define RPOR10 RPOR10
extern volatile uint16_t RPOR10 __attribute__((__sfr__));
typedef struct tagRPOR10BITS {
  uint16_t RP48R:7;
  uint16_t :1;
  uint16_t RP49R:7;
} RPOR10BITS;
extern volatile RPOR10BITS RPOR10bits __attribute__((__sfr__));

#define RPOR11 RPOR11
extern volatile uint16_t RPOR11 __attribute__((__sfr__));
typedef struct tagRPOR11BITS {
  uint16_t RP50R:7;
  uint16_t :1;
  uint16_t RP51R:7;
} RPOR11BITS;
extern volatile RPOR11BITS RPOR11bits __attribute__((__sfr__));

#define RPOR12 RPOR12
extern volatile uint16_t RPOR12 __attribute__((__sfr__));
typedef struct tagRPOR12BITS {
  uint16_t RP52R:7;
  uint16_t :1;
  uint16_t RP53R:7;
} RPOR12BITS;
extern volatile RPOR12BITS RPOR12bits __attribute__((__sfr__));

#define RPOR13 RPOR13
extern volatile uint16_t RPOR13 __attribute__((__sfr__));
typedef struct tagRPOR13BITS {
  uint16_t RP54R:7;
  uint16_t :1;
  uint16_t RP55R:7;
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

#define RPOR14 RPOR14
extern volatile uint16_t RPOR14 __attribute__((__sfr__));
typedef struct tagRPOR14BITS {
  uint16_t RP56R:7;
  uint16_t :1;
  uint16_t RP57R:7;
} RPOR14BITS;
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

#define RPOR15 RPOR15
extern volatile uint16_t RPOR15 __attribute__((__sfr__));
typedef struct tagRPOR15BITS {
  uint16_t RP58R:7;
  uint16_t :1;
  uint16_t RP60R:7;
} RPOR15BITS;
extern volatile RPOR15BITS RPOR15bits __attribute__((__sfr__));

#define RPOR16 RPOR16
extern volatile uint16_t RPOR16 __attribute__((__sfr__));
typedef struct tagRPOR16BITS {
  uint16_t RP61R:7;
  uint16_t :1;
  uint16_t RP62R:7;
} RPOR16BITS;
extern volatile RPOR16BITS RPOR16bits __attribute__((__sfr__));

#define RPOR17 RPOR17
extern volatile uint16_t RPOR17 __attribute__((__sfr__));
typedef struct tagRPOR17BITS {
  uint16_t RP63R:7;
  uint16_t :1;
  uint16_t RP64R:7;
} RPOR17BITS;
extern volatile RPOR17BITS RPOR17bits __attribute__((__sfr__));

#define RPOR18 RPOR18
extern volatile uint16_t RPOR18 __attribute__((__sfr__));
typedef struct tagRPOR18BITS {
  uint16_t RP65R:7;
  uint16_t :1;
  uint16_t RP66R:7;
} RPOR18BITS;
extern volatile RPOR18BITS RPOR18bits __attribute__((__sfr__));

#define RPOR19 RPOR19
extern volatile uint16_t RPOR19 __attribute__((__sfr__));
typedef struct tagRPOR19BITS {
  uint16_t RP67R:7;
  uint16_t :1;
  uint16_t RP68R:7;
} RPOR19BITS;
extern volatile RPOR19BITS RPOR19bits __attribute__((__sfr__));

#define RPOR20 RPOR20
extern volatile uint16_t RPOR20 __attribute__((__sfr__));
typedef struct tagRPOR20BITS {
  uint16_t RP69R:7;
  uint16_t :1;
  uint16_t RP70R:7;
} RPOR20BITS;
extern volatile RPOR20BITS RPOR20bits __attribute__((__sfr__));

#define RPOR21 RPOR21
extern volatile uint16_t RPOR21 __attribute__((__sfr__));
typedef struct tagRPOR21BITS {
  uint16_t RP71R:7;
  uint16_t :1;
  uint16_t RP72R:7;
} RPOR21BITS;
extern volatile RPOR21BITS RPOR21bits __attribute__((__sfr__));

#define RPOR22 RPOR22
extern volatile uint16_t RPOR22 __attribute__((__sfr__));
typedef struct tagRPOR22BITS {
  uint16_t RP73R:7;
  uint16_t :1;
  uint16_t RP74R:7;
} RPOR22BITS;
extern volatile RPOR22BITS RPOR22bits __attribute__((__sfr__));

#define RPOR23 RPOR23
extern volatile uint16_t RPOR23 __attribute__((__sfr__));
typedef struct tagRPOR23BITS {
  uint16_t RP75R:7;
  uint16_t :1;
  uint16_t RP76R:7;
} RPOR23BITS;
extern volatile RPOR23BITS RPOR23bits __attribute__((__sfr__));

#define RPOR24 RPOR24
extern volatile uint16_t RPOR24 __attribute__((__sfr__));
typedef struct tagRPOR24BITS {
  uint16_t RP176R:7;
  uint16_t :1;
  uint16_t RP177R:7;
} RPOR24BITS;
extern volatile RPOR24BITS RPOR24bits __attribute__((__sfr__));

#define RPOR25 RPOR25
extern volatile uint16_t RPOR25 __attribute__((__sfr__));
typedef struct tagRPOR25BITS {
  uint16_t RP178R:7;
  uint16_t :1;
  uint16_t RP179R:7;
} RPOR25BITS;
extern volatile RPOR25BITS RPOR25bits __attribute__((__sfr__));

#define RPOR26 RPOR26
extern volatile uint16_t RPOR26 __attribute__((__sfr__));
typedef struct tagRPOR26BITS {
  uint16_t RP180R:7;
  uint16_t :1;
  uint16_t RP181R:7;
} RPOR26BITS;
extern volatile RPOR26BITS RPOR26bits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile uint16_t RPINR0 __attribute__((__sfr__));
typedef struct tagRPINR0BITS {
  uint16_t :8;
  uint16_t INT1R:8;
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile uint16_t RPINR1 __attribute__((__sfr__));
typedef struct tagRPINR1BITS {
  uint16_t INT2R:8;
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile uint16_t RPINR2 __attribute__((__sfr__));
typedef struct tagRPINR2BITS {
  uint16_t :8;
  uint16_t T1CKR:8;
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

#define RPINR3 RPINR3
extern volatile uint16_t RPINR3 __attribute__((__sfr__));
typedef struct tagRPINR3BITS {
  uint16_t T2CKR:8;
  uint16_t T3CKR:8;
} RPINR3BITS;
extern volatile RPINR3BITS RPINR3bits __attribute__((__sfr__));

