MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS708/mcu.h
/* ADIEH */
#define _IE16 ADIEHbits.IE16
#define _IE17 ADIEHbits.IE17
#define _IE18 ADIEHbits.IE18
#define _IE19 ADIEHbits.IE19
#define _IE20 ADIEHbits.IE20
#define _IE21 ADIEHbits.IE21

/* ADCSSL */
#define _CSS0 ADCSSLbits.CSS0
#define _CSS1 ADCSSLbits.CSS1
#define _CSS2 ADCSSLbits.CSS2
#define _CSS3 ADCSSLbits.CSS3
#define _CSS4 ADCSSLbits.CSS4
#define _CSS5 ADCSSLbits.CSS5
#define _CSS6 ADCSSLbits.CSS6
#define _CSS7 ADCSSLbits.CSS7
#define _CSS8 ADCSSLbits.CSS8
#define _CSS9 ADCSSLbits.CSS9
#define _CSS10 ADCSSLbits.CSS10
#define _CSS11 ADCSSLbits.CSS11
#define _CSS12 ADCSSLbits.CSS12
#define _CSS13 ADCSSLbits.CSS13
#define _CSS14 ADCSSLbits.CSS14
#define _CSS15 ADCSSLbits.CSS15

/* ADCSSH */
#define _CSS16 ADCSSHbits.CSS16
#define _CSS17 ADCSSHbits.CSS17
#define _CSS18 ADCSSHbits.CSS18
#define _CSS19 ADCSSHbits.CSS19
#define _CSS20 ADCSSHbits.CSS20
#define _CSS21 ADCSSHbits.CSS21

/* ADSTATL */
#define _AN0RDY ADSTATLbits.AN0RDY
#define _AN1RDY ADSTATLbits.AN1RDY
#define _AN2RDY ADSTATLbits.AN2RDY
#define _AN3RDY ADSTATLbits.AN3RDY
#define _AN4RDY ADSTATLbits.AN4RDY
#define _AN5RDY ADSTATLbits.AN5RDY
#define _AN6RDY ADSTATLbits.AN6RDY
#define _AN7RDY ADSTATLbits.AN7RDY
#define _AN8RDY ADSTATLbits.AN8RDY
#define _AN9RDY ADSTATLbits.AN9RDY
#define _AN10RDY ADSTATLbits.AN10RDY
#define _AN11RDY ADSTATLbits.AN11RDY
#define _AN12RDY ADSTATLbits.AN12RDY
#define _AN13RDY ADSTATLbits.AN13RDY
#define _AN14RDY ADSTATLbits.AN14RDY
#define _AN15RDY ADSTATLbits.AN15RDY

/* ADSTATH */
#define _AN16RDY ADSTATHbits.AN16RDY
#define _AN17RDY ADSTATHbits.AN17RDY
#define _AN18RDY ADSTATHbits.AN18RDY
#define _AN19RDY ADSTATHbits.AN19RDY
#define _AN20RDY ADSTATHbits.AN20RDY
#define _AN21RDY ADSTATHbits.AN21RDY

/* ADCMP0ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN13 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN14 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN15 cannot be defined because it is used by more than one SFR */

/* ADCMP0ENH */
/* Bitname _CMPEN16 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN17 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN18 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN19 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN20 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN21 cannot be defined because it is used by more than one SFR */

/* ADCMP1ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN13 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN14 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN15 cannot be defined because it is used by more than one SFR */

/* ADCMP1ENH */
/* Bitname _CMPEN16 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN17 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN18 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN19 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN20 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN21 cannot be defined because it is used by more than one SFR */

/* ADFL0CON */
/* Bitname _FLCHSEL cannot be defined because it is used by more than one SFR */
/* Bitname _RDY cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM cannot be defined because it is used by more than one SFR */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _FLEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM2 cannot be defined because it is used by more than one SFR */

/* ADFL1CON */
/* Bitname _FLCHSEL cannot be defined because it is used by more than one SFR */
/* Bitname _RDY cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM cannot be defined because it is used by more than one SFR */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _FLEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _FLCHSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM2 cannot be defined because it is used by more than one SFR */

/* ADTRIG0L */
#define _TRGSRC0 ADTRIG0Lbits.TRGSRC0
#define _TRGSRC1 ADTRIG0Lbits.TRGSRC1
#define _TRIGSRC00 ADTRIG0Lbits.TRIGSRC00
#define _TRIGSRC01 ADTRIG0Lbits.TRIGSRC01
#define _TRIGSRC02 ADTRIG0Lbits.TRIGSRC02
#define _TRIGSRC03 ADTRIG0Lbits.TRIGSRC03
#define _TRIGSRC04 ADTRIG0Lbits.TRIGSRC04
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC13 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC14 cannot be defined because it is used by more than one SFR */
#define _TRGSRC00 ADTRIG0Lbits.TRGSRC00
#define _TRGSRC01 ADTRIG0Lbits.TRGSRC01
#define _TRGSRC02 ADTRIG0Lbits.TRGSRC02
#define _TRGSRC03 ADTRIG0Lbits.TRGSRC03
#define _TRGSRC04 ADTRIG0Lbits.TRGSRC04

/* ADTRIG0H */
#define _TRGSRC2 ADTRIG0Hbits.TRGSRC2
#define _TRGSRC3 ADTRIG0Hbits.TRGSRC3
#define _TRIGSRC20 ADTRIG0Hbits.TRIGSRC20
#define _TRIGSRC21 ADTRIG0Hbits.TRIGSRC21
#define _TRIGSRC22 ADTRIG0Hbits.TRIGSRC22
#define _TRIGSRC23 ADTRIG0Hbits.TRIGSRC23
#define _TRIGSRC24 ADTRIG0Hbits.TRIGSRC24
#define _TRGSRC30 ADTRIG0Hbits.TRGSRC30
#define _TRGSRC31 ADTRIG0Hbits.TRGSRC31
#define _TRGSRC32 ADTRIG0Hbits.TRGSRC32
#define _TRGSRC33 ADTRIG0Hbits.TRGSRC33
#define _TRGSRC34 ADTRIG0Hbits.TRGSRC34
/* Bitname _TRGSRC20 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC21 cannot be defined because it is used by more than one SFR */
#define _TRGSRC22 ADTRIG0Hbits.TRGSRC22
#define _TRGSRC23 ADTRIG0Hbits.TRGSRC23
#define _TRGSRC24 ADTRIG0Hbits.TRGSRC24

/* ADTRIG1L */
#define _TRGSRC4 ADTRIG1Lbits.TRGSRC4
#define _TRGSRC5 ADTRIG1Lbits.TRGSRC5
#define _TRIGSRC40 ADTRIG1Lbits.TRIGSRC40
#define _TRIGSRC41 ADTRIG1Lbits.TRIGSRC41
#define _TRIGSRC42 ADTRIG1Lbits.TRIGSRC42
#define _TRIGSRC43 ADTRIG1Lbits.TRIGSRC43
#define _TRIGSRC44 ADTRIG1Lbits.TRIGSRC44
#define _TRGSRC50 ADTRIG1Lbits.TRGSRC50
#define _TRGSRC51 ADTRIG1Lbits.TRGSRC51
#define _TRGSRC52 ADTRIG1Lbits.TRGSRC52
#define _TRGSRC53 ADTRIG1Lbits.TRGSRC53
#define _TRGSRC54 ADTRIG1Lbits.TRGSRC54
#define _TRGSRC40 ADTRIG1Lbits.TRGSRC40
#define _TRGSRC41 ADTRIG1Lbits.TRGSRC41
#define _TRGSRC42 ADTRIG1Lbits.TRGSRC42
#define _TRGSRC43 ADTRIG1Lbits.TRGSRC43
#define _TRGSRC44 ADTRIG1Lbits.TRGSRC44

/* ADTRIG1H */
#define _TRGSRC6 ADTRIG1Hbits.TRGSRC6
#define _TRGSRC7 ADTRIG1Hbits.TRGSRC7
#define _TRIGSRC60 ADTRIG1Hbits.TRIGSRC60
#define _TRIGSRC61 ADTRIG1Hbits.TRIGSRC61
#define _TRIGSRC62 ADTRIG1Hbits.TRIGSRC62
#define _TRIGSRC63 ADTRIG1Hbits.TRIGSRC63
#define _TRIGSRC64 ADTRIG1Hbits.TRIGSRC64
#define _TRGSRC70 ADTRIG1Hbits.TRGSRC70
#define _TRGSRC71 ADTRIG1Hbits.TRGSRC71
#define _TRGSRC72 ADTRIG1Hbits.TRGSRC72
#define _TRGSRC73 ADTRIG1Hbits.TRGSRC73
#define _TRGSRC74 ADTRIG1Hbits.TRGSRC74
#define _TRGSRC60 ADTRIG1Hbits.TRGSRC60
#define _TRGSRC61 ADTRIG1Hbits.TRGSRC61
#define _TRGSRC62 ADTRIG1Hbits.TRGSRC62
#define _TRGSRC63 ADTRIG1Hbits.TRGSRC63
#define _TRGSRC64 ADTRIG1Hbits.TRGSRC64

/* ADTRIG2L */
#define _TRGSRC8 ADTRIG2Lbits.TRGSRC8
#define _TRGSRC9 ADTRIG2Lbits.TRGSRC9
#define _TRIGSRC80 ADTRIG2Lbits.TRIGSRC80
#define _TRIGSRC81 ADTRIG2Lbits.TRIGSRC81
#define _TRIGSRC82 ADTRIG2Lbits.TRIGSRC82
#define _TRIGSRC83 ADTRIG2Lbits.TRIGSRC83
#define _TRIGSRC84 ADTRIG2Lbits.TRIGSRC84
#define _TRGSRC90 ADTRIG2Lbits.TRGSRC90
#define _TRGSRC91 ADTRIG2Lbits.TRGSRC91
#define _TRGSRC92 ADTRIG2Lbits.TRGSRC92
#define _TRGSRC93 ADTRIG2Lbits.TRGSRC93
#define _TRGSRC94 ADTRIG2Lbits.TRGSRC94
#define _TRGSRC80 ADTRIG2Lbits.TRGSRC80
#define _TRGSRC81 ADTRIG2Lbits.TRGSRC81
#define _TRGSRC82 ADTRIG2Lbits.TRGSRC82
#define _TRGSRC83 ADTRIG2Lbits.TRGSRC83
#define _TRGSRC84 ADTRIG2Lbits.TRGSRC84

/* ADTRIG2H */
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
#define _TRIGSRC100 ADTRIG2Hbits.TRIGSRC100
#define _TRIGSRC101 ADTRIG2Hbits.TRIGSRC101
#define _TRIGSRC102 ADTRIG2Hbits.TRIGSRC102
#define _TRIGSRC103 ADTRIG2Hbits.TRIGSRC103
#define _TRIGSRC104 ADTRIG2Hbits.TRIGSRC104
#define _TRGSRC110 ADTRIG2Hbits.TRGSRC110
#define _TRGSRC111 ADTRIG2Hbits.TRGSRC111
#define _TRGSRC112 ADTRIG2Hbits.TRGSRC112
#define _TRGSRC113 ADTRIG2Hbits.TRGSRC113
#define _TRGSRC114 ADTRIG2Hbits.TRGSRC114
#define _TRGSRC100 ADTRIG2Hbits.TRGSRC100
#define _TRGSRC101 ADTRIG2Hbits.TRGSRC101
#define _TRGSRC102 ADTRIG2Hbits.TRGSRC102
#define _TRGSRC103 ADTRIG2Hbits.TRGSRC103
#define _TRGSRC104 ADTRIG2Hbits.TRGSRC104

/* ADTRIG3L */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC13 cannot be defined because it is used by more than one SFR */
#define _TRIGSRC120 ADTRIG3Lbits.TRIGSRC120
#define _TRIGSRC121 ADTRIG3Lbits.TRIGSRC121
#define _TRIGSRC122 ADTRIG3Lbits.TRIGSRC122
#define _TRIGSRC123 ADTRIG3Lbits.TRIGSRC123
#define _TRIGSRC124 ADTRIG3Lbits.TRIGSRC124
#define _TRGSRC130 ADTRIG3Lbits.TRGSRC130
#define _TRGSRC131 ADTRIG3Lbits.TRGSRC131
#define _TRGSRC132 ADTRIG3Lbits.TRGSRC132
#define _TRGSRC133 ADTRIG3Lbits.TRGSRC133
#define _TRGSRC134 ADTRIG3Lbits.TRGSRC134
#define _TRGSRC120 ADTRIG3Lbits.TRGSRC120
#define _TRGSRC121 ADTRIG3Lbits.TRGSRC121
#define _TRGSRC122 ADTRIG3Lbits.TRGSRC122
#define _TRGSRC123 ADTRIG3Lbits.TRGSRC123
#define _TRGSRC124 ADTRIG3Lbits.TRGSRC124

/* ADTRIG3H */
/* Bitname _TRGSRC14 cannot be defined because it is used by more than one SFR */
#define _TRGSRC15 ADTRIG3Hbits.TRGSRC15
#define _TRIGSRC140 ADTRIG3Hbits.TRIGSRC140
#define _TRIGSRC141 ADTRIG3Hbits.TRIGSRC141
#define _TRIGSRC142 ADTRIG3Hbits.TRIGSRC142
#define _TRIGSRC143 ADTRIG3Hbits.TRIGSRC143
#define _TRIGSRC144 ADTRIG3Hbits.TRIGSRC144
#define _TRGSRC150 ADTRIG3Hbits.TRGSRC150
#define _TRGSRC151 ADTRIG3Hbits.TRGSRC151
#define _TRGSRC152 ADTRIG3Hbits.TRGSRC152
#define _TRGSRC153 ADTRIG3Hbits.TRGSRC153
#define _TRGSRC154 ADTRIG3Hbits.TRGSRC154
#define _TRGSRC140 ADTRIG3Hbits.TRGSRC140
#define _TRGSRC141 ADTRIG3Hbits.TRGSRC141
#define _TRGSRC142 ADTRIG3Hbits.TRGSRC142
#define _TRGSRC143 ADTRIG3Hbits.TRGSRC143
#define _TRGSRC144 ADTRIG3Hbits.TRGSRC144

/* ADTRIG4L */
#define _TRGSRC16 ADTRIG4Lbits.TRGSRC16
#define _TRGSRC17 ADTRIG4Lbits.TRGSRC17
#define _TRIGSRC160 ADTRIG4Lbits.TRIGSRC160
#define _TRIGSRC161 ADTRIG4Lbits.TRIGSRC161
#define _TRIGSRC162 ADTRIG4Lbits.TRIGSRC162
#define _TRIGSRC163 ADTRIG4Lbits.TRIGSRC163
#define _TRIGSRC164 ADTRIG4Lbits.TRIGSRC164
#define _TRGSRC170 ADTRIG4Lbits.TRGSRC170
#define _TRGSRC171 ADTRIG4Lbits.TRGSRC171
#define _TRGSRC172 ADTRIG4Lbits.TRGSRC172
#define _TRGSRC173 ADTRIG4Lbits.TRGSRC173
#define _TRGSRC174 ADTRIG4Lbits.TRGSRC174
#define _TRGSRC160 ADTRIG4Lbits.TRGSRC160
#define _TRGSRC161 ADTRIG4Lbits.TRGSRC161
#define _TRGSRC162 ADTRIG4Lbits.TRGSRC162
#define _TRGSRC163 ADTRIG4Lbits.TRGSRC163
#define _TRGSRC164 ADTRIG4Lbits.TRGSRC164

/* ADTRIG4H */
#define _TRGSRC18 ADTRIG4Hbits.TRGSRC18
#define _TRGSRC19 ADTRIG4Hbits.TRGSRC19
#define _TRIGSRC180 ADTRIG4Hbits.TRIGSRC180
#define _TRIGSRC181 ADTRIG4Hbits.TRIGSRC181
#define _TRIGSRC182 ADTRIG4Hbits.TRIGSRC182
#define _TRIGSRC183 ADTRIG4Hbits.TRIGSRC183
#define _TRIGSRC184 ADTRIG4Hbits.TRIGSRC184
#define _TRGSRC190 ADTRIG4Hbits.TRGSRC190
#define _TRGSRC191 ADTRIG4Hbits.TRGSRC191
#define _TRGSRC192 ADTRIG4Hbits.TRGSRC192
#define _TRGSRC193 ADTRIG4Hbits.TRGSRC193
#define _TRGSRC194 ADTRIG4Hbits.TRGSRC194
#define _TRGSRC180 ADTRIG4Hbits.TRGSRC180
#define _TRGSRC181 ADTRIG4Hbits.TRGSRC181
#define _TRGSRC182 ADTRIG4Hbits.TRGSRC182
#define _TRGSRC183 ADTRIG4Hbits.TRGSRC183
#define _TRGSRC184 ADTRIG4Hbits.TRGSRC184

/* ADTRIG5L */
/* Bitname _TRGSRC20 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC21 cannot be defined because it is used by more than one SFR */
#define _TRIGSRC200 ADTRIG5Lbits.TRIGSRC200
#define _TRIGSRC201 ADTRIG5Lbits.TRIGSRC201
#define _TRIGSRC202 ADTRIG5Lbits.TRIGSRC202
#define _TRIGSRC203 ADTRIG5Lbits.TRIGSRC203
#define _TRIGSRC204 ADTRIG5Lbits.TRIGSRC204
#define _TRGSRC210 ADTRIG5Lbits.TRGSRC210
#define _TRGSRC211 ADTRIG5Lbits.TRGSRC211
#define _TRGSRC212 ADTRIG5Lbits.TRGSRC212
#define _TRGSRC213 ADTRIG5Lbits.TRGSRC213
#define _TRGSRC214 ADTRIG5Lbits.TRGSRC214
#define _TRGSRC200 ADTRIG5Lbits.TRGSRC200
#define _TRGSRC201 ADTRIG5Lbits.TRGSRC201
#define _TRGSRC202 ADTRIG5Lbits.TRGSRC202
#define _TRGSRC203 ADTRIG5Lbits.TRGSRC203
#define _TRGSRC204 ADTRIG5Lbits.TRGSRC204

/* ADCMP0CON */
/* Bitname _LOLO cannot be defined because it is used by more than one SFR */
/* Bitname _LOHI cannot be defined because it is used by more than one SFR */
/* Bitname _HILO cannot be defined because it is used by more than one SFR */
/* Bitname _HIHI cannot be defined because it is used by more than one SFR */
/* Bitname _BTWN cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL4 cannot be defined because it is used by more than one SFR */

/* ADCMP1CON */
/* Bitname _LOLO cannot be defined because it is used by more than one SFR */
/* Bitname _LOHI cannot be defined because it is used by more than one SFR */
/* Bitname _HILO cannot be defined because it is used by more than one SFR */
/* Bitname _HIHI cannot be defined because it is used by more than one SFR */
/* Bitname _BTWN cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL4 cannot be defined because it is used by more than one SFR */

/* ADBASE */
#define _CHOFFSET ADBASEbits.CHOFFSET
#define _CHOFFSET0 ADBASEbits.CHOFFSET0
#define _CHOFFSET1 ADBASEbits.CHOFFSET1
#define _CHOFFSET2 ADBASEbits.CHOFFSET2
#define _CHOFFSET3 ADBASEbits.CHOFFSET3
#define _CHOFFSET4 ADBASEbits.CHOFFSET4
#define _CHOFFSET5 ADBASEbits.CHOFFSET5
#define _CHOFFSET6 ADBASEbits.CHOFFSET6
#define _CHOFFSET7 ADBASEbits.CHOFFSET7
#define _CHOFFSET8 ADBASEbits.CHOFFSET8
#define _CHOFFSET9 ADBASEbits.CHOFFSET9
#define _CHOFFSET10 ADBASEbits.CHOFFSET10
#define _CHOFFSET11 ADBASEbits.CHOFFSET11
#define _CHOFFSET12 ADBASEbits.CHOFFSET12
#define _CHOFFSET13 ADBASEbits.CHOFFSET13
#define _CHOFFSET14 ADBASEbits.CHOFFSET14
#define _CHOFFSET15 ADBASEbits.CHOFFSET15

/* ADLVLTRGL */
#define _LVLEN0 ADLVLTRGLbits.LVLEN0
#define _LVLEN1 ADLVLTRGLbits.LVLEN1
#define _LVLEN2 ADLVLTRGLbits.LVLEN2
#define _LVLEN3 ADLVLTRGLbits.LVLEN3
#define _LVLEN4 ADLVLTRGLbits.LVLEN4
#define _LVLEN5 ADLVLTRGLbits.LVLEN5
#define _LVLEN6 ADLVLTRGLbits.LVLEN6
#define _LVLEN7 ADLVLTRGLbits.LVLEN7
#define _LVLEN8 ADLVLTRGLbits.LVLEN8
#define _LVLEN9 ADLVLTRGLbits.LVLEN9
#define _LVLEN10 ADLVLTRGLbits.LVLEN10
#define _LVLEN11 ADLVLTRGLbits.LVLEN11
#define _LVLEN12 ADLVLTRGLbits.LVLEN12
#define _LVLEN13 ADLVLTRGLbits.LVLEN13
#define _LVLEN14 ADLVLTRGLbits.LVLEN14
#define _LVLEN15 ADLVLTRGLbits.LVLEN15

/* ADLVLTRGH */
#define _LVLEN16 ADLVLTRGHbits.LVLEN16
#define _LVLEN17 ADLVLTRGHbits.LVLEN17
#define _LVLEN18 ADLVLTRGHbits.LVLEN18
#define _LVLEN19 ADLVLTRGHbits.LVLEN19
#define _LVLEN20 ADLVLTRGHbits.LVLEN20
#define _LVLEN21 ADLVLTRGHbits.LVLEN21

/* ADCORE0L */
/* Bitname _SAMC cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC4 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC5 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC6 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC7 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC8 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC9 cannot be defined because it is used by more than one SFR */

