MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS708/mcu.h
/* OC4CON1 */
/* Bitname _OCM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGMODE cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTA cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTA cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _OCSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _OCM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT0 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT0 cannot be defined because it is used by more than one SFR */

/* OC4CON2 */
/* Bitname _SYNCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _OCTRIS cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _OCTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _OC32 cannot be defined because it is used by more than one SFR */
/* Bitname _OCINV cannot be defined because it is used by more than one SFR */
/* Bitname _FLTTRIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLTOUT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTMD cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTMODE cannot be defined because it is used by more than one SFR */

/* CLC1CONL */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _LCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _LCOUT cannot be defined because it is used by more than one SFR */
/* Bitname _LCOE cannot be defined because it is used by more than one SFR */
/* Bitname _INTN cannot be defined because it is used by more than one SFR */
/* Bitname _INTP cannot be defined because it is used by more than one SFR */
/* Bitname _LCEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE2 cannot be defined because it is used by more than one SFR */

/* CLC1CONH */
/* Bitname _G1POL cannot be defined because it is used by more than one SFR */
/* Bitname _G2POL cannot be defined because it is used by more than one SFR */
/* Bitname _G3POL cannot be defined because it is used by more than one SFR */
/* Bitname _G4POL cannot be defined because it is used by more than one SFR */

/* CLC1SEL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

/* CLC1GLSL */
/* Bitname _G1D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4T cannot be defined because it is used by more than one SFR */

/* CLC1GLSH */
/* Bitname _G3D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4T cannot be defined because it is used by more than one SFR */

/* CLC2CONL */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _LCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _LCOUT cannot be defined because it is used by more than one SFR */
/* Bitname _LCOE cannot be defined because it is used by more than one SFR */
/* Bitname _INTN cannot be defined because it is used by more than one SFR */
/* Bitname _INTP cannot be defined because it is used by more than one SFR */
/* Bitname _LCEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE2 cannot be defined because it is used by more than one SFR */

/* CLC2CONH */
/* Bitname _G1POL cannot be defined because it is used by more than one SFR */
/* Bitname _G2POL cannot be defined because it is used by more than one SFR */
/* Bitname _G3POL cannot be defined because it is used by more than one SFR */
/* Bitname _G4POL cannot be defined because it is used by more than one SFR */

/* CLC2SEL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

/* CLC2SELL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

/* CLC2GLSL */
/* Bitname _G1D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4T cannot be defined because it is used by more than one SFR */

