MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS708/mcu.h
#define _ADCORE3L_SAMC7_POSITION                 0x00000007
#define _ADCORE3L_SAMC7_MASK                     0x00000080
#define _ADCORE3L_SAMC7_LENGTH                   0x00000001

#define _ADCORE3L_SAMC8_POSITION                 0x00000008
#define _ADCORE3L_SAMC8_MASK                     0x00000100
#define _ADCORE3L_SAMC8_LENGTH                   0x00000001

#define _ADCORE3L_SAMC9_POSITION                 0x00000009
#define _ADCORE3L_SAMC9_MASK                     0x00000200
#define _ADCORE3L_SAMC9_LENGTH                   0x00000001

#define _ADCORE3H_ADCS_POSITION                  0x00000000
#define _ADCORE3H_ADCS_MASK                      0x0000007F
#define _ADCORE3H_ADCS_LENGTH                    0x00000007

#define _ADCORE3H_RES_POSITION                   0x00000008
#define _ADCORE3H_RES_MASK                       0x00000300
#define _ADCORE3H_RES_LENGTH                     0x00000002

#define _ADCORE3H_EISEL_POSITION                 0x0000000A
#define _ADCORE3H_EISEL_MASK                     0x00001C00
#define _ADCORE3H_EISEL_LENGTH                   0x00000003

#define _ADCORE3H_ADCS0_POSITION                 0x00000000
#define _ADCORE3H_ADCS0_MASK                     0x00000001
#define _ADCORE3H_ADCS0_LENGTH                   0x00000001

#define _ADCORE3H_ADCS1_POSITION                 0x00000001
#define _ADCORE3H_ADCS1_MASK                     0x00000002
#define _ADCORE3H_ADCS1_LENGTH                   0x00000001

#define _ADCORE3H_ADCS2_POSITION                 0x00000002
#define _ADCORE3H_ADCS2_MASK                     0x00000004
#define _ADCORE3H_ADCS2_LENGTH                   0x00000001

#define _ADCORE3H_ADCS3_POSITION                 0x00000003
#define _ADCORE3H_ADCS3_MASK                     0x00000008
#define _ADCORE3H_ADCS3_LENGTH                   0x00000001

#define _ADCORE3H_ADCS4_POSITION                 0x00000004
#define _ADCORE3H_ADCS4_MASK                     0x00000010
#define _ADCORE3H_ADCS4_LENGTH                   0x00000001

#define _ADCORE3H_ADCS5_POSITION                 0x00000005
#define _ADCORE3H_ADCS5_MASK                     0x00000020
#define _ADCORE3H_ADCS5_LENGTH                   0x00000001

#define _ADCORE3H_ADCS6_POSITION                 0x00000006
#define _ADCORE3H_ADCS6_MASK                     0x00000040
#define _ADCORE3H_ADCS6_LENGTH                   0x00000001

#define _ADCORE3H_RES0_POSITION                  0x00000008
#define _ADCORE3H_RES0_MASK                      0x00000100
#define _ADCORE3H_RES0_LENGTH                    0x00000001

#define _ADCORE3H_RES1_POSITION                  0x00000009
#define _ADCORE3H_RES1_MASK                      0x00000200
#define _ADCORE3H_RES1_LENGTH                    0x00000001

#define _ADCORE3H_EISEL0_POSITION                0x0000000A
#define _ADCORE3H_EISEL0_MASK                    0x00000400
#define _ADCORE3H_EISEL0_LENGTH                  0x00000001

#define _ADCORE3H_EISEL1_POSITION                0x0000000B
#define _ADCORE3H_EISEL1_MASK                    0x00000800
#define _ADCORE3H_EISEL1_LENGTH                  0x00000001

#define _ADCORE3H_EISEL2_POSITION                0x0000000C
#define _ADCORE3H_EISEL2_MASK                    0x00001000
#define _ADCORE3H_EISEL2_LENGTH                  0x00000001

#define _ADEIEL_EIEN0_POSITION                   0x00000000
#define _ADEIEL_EIEN0_MASK                       0x00000001
#define _ADEIEL_EIEN0_LENGTH                     0x00000001

#define _ADEIEL_EIEN1_POSITION                   0x00000001
#define _ADEIEL_EIEN1_MASK                       0x00000002
#define _ADEIEL_EIEN1_LENGTH                     0x00000001

#define _ADEIEL_EIEN2_POSITION                   0x00000002
#define _ADEIEL_EIEN2_MASK                       0x00000004
#define _ADEIEL_EIEN2_LENGTH                     0x00000001

#define _ADEIEL_EIEN3_POSITION                   0x00000003
#define _ADEIEL_EIEN3_MASK                       0x00000008
#define _ADEIEL_EIEN3_LENGTH                     0x00000001

#define _ADEIEL_EIEN4_POSITION                   0x00000004
#define _ADEIEL_EIEN4_MASK                       0x00000010
#define _ADEIEL_EIEN4_LENGTH                     0x00000001

#define _ADEIEL_EIEN5_POSITION                   0x00000005
#define _ADEIEL_EIEN5_MASK                       0x00000020
#define _ADEIEL_EIEN5_LENGTH                     0x00000001

#define _ADEIEL_EIEN6_POSITION                   0x00000006
#define _ADEIEL_EIEN6_MASK                       0x00000040
#define _ADEIEL_EIEN6_LENGTH                     0x00000001

#define _ADEIEL_EIEN7_POSITION                   0x00000007
#define _ADEIEL_EIEN7_MASK                       0x00000080
#define _ADEIEL_EIEN7_LENGTH                     0x00000001

#define _ADEIEL_EIEN8_POSITION                   0x00000008
#define _ADEIEL_EIEN8_MASK                       0x00000100
#define _ADEIEL_EIEN8_LENGTH                     0x00000001

#define _ADEIEL_EIEN9_POSITION                   0x00000009
#define _ADEIEL_EIEN9_MASK                       0x00000200
#define _ADEIEL_EIEN9_LENGTH                     0x00000001

#define _ADEIEL_EIEN10_POSITION                  0x0000000A
#define _ADEIEL_EIEN10_MASK                      0x00000400
#define _ADEIEL_EIEN10_LENGTH                    0x00000001

#define _ADEIEL_EIEN11_POSITION                  0x0000000B
#define _ADEIEL_EIEN11_MASK                      0x00000800
#define _ADEIEL_EIEN11_LENGTH                    0x00000001

#define _ADEIEL_EIEN12_POSITION                  0x0000000C
#define _ADEIEL_EIEN12_MASK                      0x00001000
#define _ADEIEL_EIEN12_LENGTH                    0x00000001

#define _ADEIEL_EIEN13_POSITION                  0x0000000D
#define _ADEIEL_EIEN13_MASK                      0x00002000
#define _ADEIEL_EIEN13_LENGTH                    0x00000001

#define _ADEIEL_EIEN14_POSITION                  0x0000000E
#define _ADEIEL_EIEN14_MASK                      0x00004000
#define _ADEIEL_EIEN14_LENGTH                    0x00000001

#define _ADEIEL_EIEN15_POSITION                  0x0000000F
#define _ADEIEL_EIEN15_MASK                      0x00008000
#define _ADEIEL_EIEN15_LENGTH                    0x00000001

#define _ADEIEH_EIEN16_POSITION                  0x00000000
#define _ADEIEH_EIEN16_MASK                      0x00000001
#define _ADEIEH_EIEN16_LENGTH                    0x00000001

#define _ADEIEH_EIEN17_POSITION                  0x00000001
#define _ADEIEH_EIEN17_MASK                      0x00000002
#define _ADEIEH_EIEN17_LENGTH                    0x00000001

#define _ADEIEH_EIEN18_POSITION                  0x00000002
#define _ADEIEH_EIEN18_MASK                      0x00000004
#define _ADEIEH_EIEN18_LENGTH                    0x00000001

#define _ADEIEH_EIEN19_POSITION                  0x00000003
#define _ADEIEH_EIEN19_MASK                      0x00000008
#define _ADEIEH_EIEN19_LENGTH                    0x00000001

#define _ADEIEH_EIEN20_POSITION                  0x00000004
#define _ADEIEH_EIEN20_MASK                      0x00000010
#define _ADEIEH_EIEN20_LENGTH                    0x00000001

#define _ADEIEH_EIEN21_POSITION                  0x00000005
#define _ADEIEH_EIEN21_MASK                      0x00000020
#define _ADEIEH_EIEN21_LENGTH                    0x00000001

#define _ADEISTATL_EISTAT0_POSITION              0x00000000
#define _ADEISTATL_EISTAT0_MASK                  0x00000001
#define _ADEISTATL_EISTAT0_LENGTH                0x00000001

#define _ADEISTATL_EISTAT1_POSITION              0x00000001
#define _ADEISTATL_EISTAT1_MASK                  0x00000002
#define _ADEISTATL_EISTAT1_LENGTH                0x00000001

#define _ADEISTATL_EISTAT2_POSITION              0x00000002
#define _ADEISTATL_EISTAT2_MASK                  0x00000004
#define _ADEISTATL_EISTAT2_LENGTH                0x00000001

#define _ADEISTATL_EISTAT3_POSITION              0x00000003
#define _ADEISTATL_EISTAT3_MASK                  0x00000008
#define _ADEISTATL_EISTAT3_LENGTH                0x00000001

#define _ADEISTATL_EISTAT4_POSITION              0x00000004
#define _ADEISTATL_EISTAT4_MASK                  0x00000010
#define _ADEISTATL_EISTAT4_LENGTH                0x00000001

#define _ADEISTATL_EISTAT5_POSITION              0x00000005
#define _ADEISTATL_EISTAT5_MASK                  0x00000020
#define _ADEISTATL_EISTAT5_LENGTH                0x00000001

#define _ADEISTATL_EISTAT6_POSITION              0x00000006
#define _ADEISTATL_EISTAT6_MASK                  0x00000040
#define _ADEISTATL_EISTAT6_LENGTH                0x00000001

#define _ADEISTATL_EISTAT7_POSITION              0x00000007
#define _ADEISTATL_EISTAT7_MASK                  0x00000080
#define _ADEISTATL_EISTAT7_LENGTH                0x00000001

#define _ADEISTATL_EISTAT8_POSITION              0x00000008
#define _ADEISTATL_EISTAT8_MASK                  0x00000100
#define _ADEISTATL_EISTAT8_LENGTH                0x00000001

#define _ADEISTATL_EISTAT9_POSITION              0x00000009
#define _ADEISTATL_EISTAT9_MASK                  0x00000200
#define _ADEISTATL_EISTAT9_LENGTH                0x00000001

#define _ADEISTATL_EISTAT10_POSITION             0x0000000A
#define _ADEISTATL_EISTAT10_MASK                 0x00000400
#define _ADEISTATL_EISTAT10_LENGTH               0x00000001

#define _ADEISTATL_EISTAT11_POSITION             0x0000000B
#define _ADEISTATL_EISTAT11_MASK                 0x00000800
#define _ADEISTATL_EISTAT11_LENGTH               0x00000001

#define _ADEISTATL_EISTAT12_POSITION             0x0000000C
#define _ADEISTATL_EISTAT12_MASK                 0x00001000
#define _ADEISTATL_EISTAT12_LENGTH               0x00000001

#define _ADEISTATL_EISTAT13_POSITION             0x0000000D
#define _ADEISTATL_EISTAT13_MASK                 0x00002000
#define _ADEISTATL_EISTAT13_LENGTH               0x00000001

#define _ADEISTATL_EISTAT14_POSITION             0x0000000E
#define _ADEISTATL_EISTAT14_MASK                 0x00004000
#define _ADEISTATL_EISTAT14_LENGTH               0x00000001

#define _ADEISTATL_EISTAT15_POSITION             0x0000000F
#define _ADEISTATL_EISTAT15_MASK                 0x00008000
#define _ADEISTATL_EISTAT15_LENGTH               0x00000001

