MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS708/mcu.h
#define _ADEISTATH_EISTAT16_POSITION             0x00000000
#define _ADEISTATH_EISTAT16_MASK                 0x00000001
#define _ADEISTATH_EISTAT16_LENGTH               0x00000001

#define _ADEISTATH_EISTAT17_POSITION             0x00000001
#define _ADEISTATH_EISTAT17_MASK                 0x00000002
#define _ADEISTATH_EISTAT17_LENGTH               0x00000001

#define _ADEISTATH_EISTAT18_POSITION             0x00000002
#define _ADEISTATH_EISTAT18_MASK                 0x00000004
#define _ADEISTATH_EISTAT18_LENGTH               0x00000001

#define _ADEISTATH_EISTAT19_POSITION             0x00000003
#define _ADEISTATH_EISTAT19_MASK                 0x00000008
#define _ADEISTATH_EISTAT19_LENGTH               0x00000001

#define _ADEISTATH_EISTAT20_POSITION             0x00000004
#define _ADEISTATH_EISTAT20_MASK                 0x00000010
#define _ADEISTATH_EISTAT20_LENGTH               0x00000001

#define _ADEISTATH_EISTAT21_POSITION             0x00000005
#define _ADEISTATH_EISTAT21_MASK                 0x00000020
#define _ADEISTATH_EISTAT21_LENGTH               0x00000001

#define _ADCON5L_C0PWR_POSITION                  0x00000000
#define _ADCON5L_C0PWR_MASK                      0x00000001
#define _ADCON5L_C0PWR_LENGTH                    0x00000001

#define _ADCON5L_C1PWR_POSITION                  0x00000001
#define _ADCON5L_C1PWR_MASK                      0x00000002
#define _ADCON5L_C1PWR_LENGTH                    0x00000001

#define _ADCON5L_C2PWR_POSITION                  0x00000002
#define _ADCON5L_C2PWR_MASK                      0x00000004
#define _ADCON5L_C2PWR_LENGTH                    0x00000001

#define _ADCON5L_C3PWR_POSITION                  0x00000003
#define _ADCON5L_C3PWR_MASK                      0x00000008
#define _ADCON5L_C3PWR_LENGTH                    0x00000001

#define _ADCON5L_SHRPWR_POSITION                 0x00000007
#define _ADCON5L_SHRPWR_MASK                     0x00000080
#define _ADCON5L_SHRPWR_LENGTH                   0x00000001

#define _ADCON5L_C0RDY_POSITION                  0x00000008
#define _ADCON5L_C0RDY_MASK                      0x00000100
#define _ADCON5L_C0RDY_LENGTH                    0x00000001

#define _ADCON5L_C1RDY_POSITION                  0x00000009
#define _ADCON5L_C1RDY_MASK                      0x00000200
#define _ADCON5L_C1RDY_LENGTH                    0x00000001

#define _ADCON5L_C2RDY_POSITION                  0x0000000A
#define _ADCON5L_C2RDY_MASK                      0x00000400
#define _ADCON5L_C2RDY_LENGTH                    0x00000001

#define _ADCON5L_C3RDY_POSITION                  0x0000000B
#define _ADCON5L_C3RDY_MASK                      0x00000800
#define _ADCON5L_C3RDY_LENGTH                    0x00000001

#define _ADCON5L_SHRRDY_POSITION                 0x0000000F
#define _ADCON5L_SHRRDY_MASK                     0x00008000
#define _ADCON5L_SHRRDY_LENGTH                   0x00000001

#define _ADCON5H_C0CIE_POSITION                  0x00000000
#define _ADCON5H_C0CIE_MASK                      0x00000001
#define _ADCON5H_C0CIE_LENGTH                    0x00000001

#define _ADCON5H_C1CIE_POSITION                  0x00000001
#define _ADCON5H_C1CIE_MASK                      0x00000002
#define _ADCON5H_C1CIE_LENGTH                    0x00000001

#define _ADCON5H_C2CIE_POSITION                  0x00000002
#define _ADCON5H_C2CIE_MASK                      0x00000004
#define _ADCON5H_C2CIE_LENGTH                    0x00000001

#define _ADCON5H_C3CIE_POSITION                  0x00000003
#define _ADCON5H_C3CIE_MASK                      0x00000008
#define _ADCON5H_C3CIE_LENGTH                    0x00000001

#define _ADCON5H_SHRCIE_POSITION                 0x00000007
#define _ADCON5H_SHRCIE_MASK                     0x00000080
#define _ADCON5H_SHRCIE_LENGTH                   0x00000001

#define _ADCON5H_WARMTIME_POSITION               0x00000008
#define _ADCON5H_WARMTIME_MASK                   0x00000F00
#define _ADCON5H_WARMTIME_LENGTH                 0x00000004

#define _ADCON5H_C0C1E_POSITION                  0x00000000
#define _ADCON5H_C0C1E_MASK                      0x00000001
#define _ADCON5H_C0C1E_LENGTH                    0x00000001

#define _ADCON5H_C1C1E_POSITION                  0x00000001
#define _ADCON5H_C1C1E_MASK                      0x00000002
#define _ADCON5H_C1C1E_LENGTH                    0x00000001

#define _ADCON5H_C2C1E_POSITION                  0x00000002
#define _ADCON5H_C2C1E_MASK                      0x00000004
#define _ADCON5H_C2C1E_LENGTH                    0x00000001

#define _ADCON5H_C3C1E_POSITION                  0x00000003
#define _ADCON5H_C3C1E_MASK                      0x00000008
#define _ADCON5H_C3C1E_LENGTH                    0x00000001

#define _ADCAL0L_CAL0RUN_POSITION                0x00000000
#define _ADCAL0L_CAL0RUN_MASK                    0x00000001
#define _ADCAL0L_CAL0RUN_LENGTH                  0x00000001

#define _ADCAL0L_CAL0EN_POSITION                 0x00000001
#define _ADCAL0L_CAL0EN_MASK                     0x00000002
#define _ADCAL0L_CAL0EN_LENGTH                   0x00000001

#define _ADCAL0L_CAL0DIFF_POSITION               0x00000002
#define _ADCAL0L_CAL0DIFF_MASK                   0x00000004
#define _ADCAL0L_CAL0DIFF_LENGTH                 0x00000001

#define _ADCAL0L_CAL0SKIP_POSITION               0x00000003
#define _ADCAL0L_CAL0SKIP_MASK                   0x00000008
#define _ADCAL0L_CAL0SKIP_LENGTH                 0x00000001

#define _ADCAL0L_CAL0RDY_POSITION                0x00000007
#define _ADCAL0L_CAL0RDY_MASK                    0x00000080
#define _ADCAL0L_CAL0RDY_LENGTH                  0x00000001

#define _ADCAL0L_CAL1RUN_POSITION                0x00000008
#define _ADCAL0L_CAL1RUN_MASK                    0x00000100
#define _ADCAL0L_CAL1RUN_LENGTH                  0x00000001

#define _ADCAL0L_CAL1EN_POSITION                 0x00000009
#define _ADCAL0L_CAL1EN_MASK                     0x00000200
#define _ADCAL0L_CAL1EN_LENGTH                   0x00000001

#define _ADCAL0L_CAL1DIFF_POSITION               0x0000000A
#define _ADCAL0L_CAL1DIFF_MASK                   0x00000400
#define _ADCAL0L_CAL1DIFF_LENGTH                 0x00000001

#define _ADCAL0L_CAL1SKIP_POSITION               0x0000000B
#define _ADCAL0L_CAL1SKIP_MASK                   0x00000800
#define _ADCAL0L_CAL1SKIP_LENGTH                 0x00000001

#define _ADCAL0L_CAL1RDY_POSITION                0x0000000F
#define _ADCAL0L_CAL1RDY_MASK                    0x00008000
#define _ADCAL0L_CAL1RDY_LENGTH                  0x00000001

#define _ADCAL0H_CAL2RUN_POSITION                0x00000000
#define _ADCAL0H_CAL2RUN_MASK                    0x00000001
#define _ADCAL0H_CAL2RUN_LENGTH                  0x00000001

#define _ADCAL0H_CAL2EN_POSITION                 0x00000001
#define _ADCAL0H_CAL2EN_MASK                     0x00000002
#define _ADCAL0H_CAL2EN_LENGTH                   0x00000001

