MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS708/mcu.h
#define _IFS9_ADCAN16IF_POSITION                 0x0000000F
#define _IFS9_ADCAN16IF_MASK                     0x00008000
#define _IFS9_ADCAN16IF_LENGTH                   0x00000001

#define _IFS10_ADCAN17IF_POSITION                0x00000000
#define _IFS10_ADCAN17IF_MASK                    0x00000001
#define _IFS10_ADCAN17IF_LENGTH                  0x00000001

#define _IFS10_ADCAN18IF_POSITION                0x00000001
#define _IFS10_ADCAN18IF_MASK                    0x00000002
#define _IFS10_ADCAN18IF_LENGTH                  0x00000001

#define _IFS10_ADCAN19IF_POSITION                0x00000002
#define _IFS10_ADCAN19IF_MASK                    0x00000004
#define _IFS10_ADCAN19IF_LENGTH                  0x00000001

#define _IFS10_ADCAN20IF_POSITION                0x00000003
#define _IFS10_ADCAN20IF_MASK                    0x00000008
#define _IFS10_ADCAN20IF_LENGTH                  0x00000001

#define _IFS10_ADCAN21IF_POSITION                0x00000004
#define _IFS10_ADCAN21IF_MASK                    0x00000010
#define _IFS10_ADCAN21IF_LENGTH                  0x00000001

#define _IFS10_I2C1BCIF_POSITION                 0x0000000D
#define _IFS10_I2C1BCIF_MASK                     0x00002000
#define _IFS10_I2C1BCIF_LENGTH                   0x00000001

#define _IFS10_I2C2BCIF_POSITION                 0x0000000E
#define _IFS10_I2C2BCIF_MASK                     0x00004000
#define _IFS10_I2C2BCIF_LENGTH                   0x00000001

#define _IFS11_ADCMP0IF_POSITION                 0x00000001
#define _IFS11_ADCMP0IF_MASK                     0x00000002
#define _IFS11_ADCMP0IF_LENGTH                   0x00000001

#define _IFS11_ADCMP1IF_POSITION                 0x00000002
#define _IFS11_ADCMP1IF_MASK                     0x00000004
#define _IFS11_ADCMP1IF_LENGTH                   0x00000001

#define _IFS11_ADFLTR0IF_POSITION                0x00000003
#define _IFS11_ADFLTR0IF_MASK                    0x00000008
#define _IFS11_ADFLTR0IF_LENGTH                  0x00000001

#define _IFS11_ADFLTR1IF_POSITION                0x00000004
#define _IFS11_ADFLTR1IF_MASK                    0x00000010
#define _IFS11_ADFLTR1IF_LENGTH                  0x00000001

#define _IFS11_ADCC0EIF_POSITION                 0x0000000B
#define _IFS11_ADCC0EIF_MASK                     0x00000800
#define _IFS11_ADCC0EIF_LENGTH                   0x00000001

#define _IFS11_ADCC1EIF_POSITION                 0x0000000C
#define _IFS11_ADCC1EIF_MASK                     0x00001000
#define _IFS11_ADCC1EIF_LENGTH                   0x00000001

#define _IFS11_ADCC2EIF_POSITION                 0x0000000D
#define _IFS11_ADCC2EIF_MASK                     0x00002000
#define _IFS11_ADCC2EIF_LENGTH                   0x00000001

#define _IFS11_ADCC3EIF_POSITION                 0x0000000E
#define _IFS11_ADCC3EIF_MASK                     0x00004000
#define _IFS11_ADCC3EIF_LENGTH                   0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000001
#define _IEC0_IC1IE_MASK                         0x00000002
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000002
#define _IEC0_OC1IE_MASK                         0x00000004
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x00000003
#define _IEC0_T1IE_MASK                          0x00000008
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_IC2IE_POSITION                     0x00000005
#define _IEC0_IC2IE_MASK                         0x00000020
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x00000006
#define _IEC0_OC2IE_MASK                         0x00000040
#define _IEC0_OC2IE_LENGTH                       0x00000001

#define _IEC0_T2IE_POSITION                      0x00000007
#define _IEC0_T2IE_MASK                          0x00000080
#define _IEC0_T2IE_LENGTH                        0x00000001

#define _IEC0_T3IE_POSITION                      0x00000008
#define _IEC0_T3IE_MASK                          0x00000100
#define _IEC0_T3IE_LENGTH                        0x00000001

#define _IEC0_SPI1TXIE_POSITION                  0x00000009
#define _IEC0_SPI1TXIE_MASK                      0x00000200
#define _IEC0_SPI1TXIE_LENGTH                    0x00000001

#define _IEC0_SPI1RXIE_POSITION                  0x0000000A
#define _IEC0_SPI1RXIE_MASK                      0x00000400
#define _IEC0_SPI1RXIE_LENGTH                    0x00000001

#define _IEC0_U1RXIE_POSITION                    0x0000000B
#define _IEC0_U1RXIE_MASK                        0x00000800
#define _IEC0_U1RXIE_LENGTH                      0x00000001

#define _IEC0_U1TXIE_POSITION                    0x0000000C
#define _IEC0_U1TXIE_MASK                        0x00001000
#define _IEC0_U1TXIE_LENGTH                      0x00000001

#define _IEC0_ADCIE_POSITION                     0x0000000D
#define _IEC0_ADCIE_MASK                         0x00002000
#define _IEC0_ADCIE_LENGTH                       0x00000001

#define _IEC0_NVMIE_POSITION                     0x0000000F
#define _IEC0_NVMIE_MASK                         0x00008000
#define _IEC0_NVMIE_LENGTH                       0x00000001

#define _IEC1_SI2C1IE_POSITION                   0x00000000
#define _IEC1_SI2C1IE_MASK                       0x00000001
#define _IEC1_SI2C1IE_LENGTH                     0x00000001

#define _IEC1_MI2C1IE_POSITION                   0x00000001
#define _IEC1_MI2C1IE_MASK                       0x00000002
#define _IEC1_MI2C1IE_LENGTH                     0x00000001

#define _IEC1_AC1IE_POSITION                     0x00000002
#define _IEC1_AC1IE_MASK                         0x00000004
#define _IEC1_AC1IE_LENGTH                       0x00000001

#define _IEC1_CNIE_POSITION                      0x00000003
#define _IEC1_CNIE_MASK                          0x00000008
#define _IEC1_CNIE_LENGTH                        0x00000001

